// ======================================================
// XIAOMI WEBBASE
// PRODUCTS-DATA.JS
// ======================================================

// ======================================================
// НАЧАЛЬНАЯ БАЗА
// ======================================================
//
// Нужна только до первой успешной загрузки 1С.
//
// После загрузки файла 1С база сохраняется
// в localStorage.
// ======================================================

let products = [

    {
        id: "test-001",

        name:
            "Xiaomi 17 12GB+256GB Black",

        category:
            "Смартфоны",

        memory:
            "12GB+256GB",

        color:
            "Black",

        display:
            1,

        warehouse:
            2,

        quantity:
            3,

        description:
            "Тестовый товар для настройки системы.",

        tip:
            "Тестовая карточка.",

        specs: {

            "Память":
                "12GB+256GB",

            "Цвет":
                "Black"

        }

    }

];